In [1]:
import pandas as pd

print(pd.__version__)

2.2.2

In [4]:
import numpy as np

<h2>Creating Series</h2>

<h3>From List</h3>

In [5]:
list = [1,4,6,9,5]
s = pd.Series(list)
print(s)

0    1
1    4
2    6
3    9
4    5
dtype: int64

<h3>From numpy Array</h3>

In [12]:
arr = np.array([1,4,7,8,10])
s = pd.Series(arr)
print(s)

0     1
1     4
2     7
3     8
4    10
dtype: int32

<h3>Giving Index from our own end</h3>

In [13]:
s = pd.Series([1,2,3,4], index=['a','b','c','d'])
s

a    1
b    2
c    3
d    4
dtype: int64

<h3>From Dictionary</h3>

In [14]:
dic = {1:'a', 2:'b', 3:'c', 4:'d'}
s = pd.Series(dic)
s

1    a
2    b
3    c
4    d
dtype: object

<h3>Repeat</h3>

In [22]:
h = pd.Series(3, index=['a'])
m = h.repeat(3)
m

a    3
a    3
a    3
dtype: int64

<h3>Reset</h3>

In [23]:
m = h.repeat(3)
m.reset_index(drop = 'true')

0    3
1    3
2    3
dtype: int64

In [25]:
pd.Series([10,2], index=['a','b']).repeat([3,2]).reset_index(drop='true')

0    10
1    10
2    10
3     2
4     2
dtype: int64

<h3>Aggregate</h3>

In [28]:
sr = pd.Series([1,2,3,4,5,6,7])

h = sr.agg([min,max,sum])
print(h)

min     1
max     7
sum    28
dtype: int64

C:\Users\kalat\AppData\Local\Temp\ipykernel_3040\1123326056.py:3: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  h = sr.agg([min,max,sum])
C:\Users\kalat\AppData\Local\Temp\ipykernel_3040\1123326056.py:3: FutureWarning: The provided callable <built-in function max> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  h = sr.agg([min,max,sum])
C:\Users\kalat\AppData\Local\Temp\ipykernel_3040\1123326056.py:3: FutureWarning: The provided callable <built-in function sum> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  h = sr.agg([min,max,sum])

<h3>Absolute Function</h3>

In [31]:
sr = pd.Series([1.4,-4,11.0,56])
sr.abs()

0     1.4
1     4.0
2    11.0
3    56.0
dtype: float64

<h3>Appending</h3>

In [35]:
s1 = pd.Series([1,2])
s2 = pd.Series(3)
s3 = pd.concat((s1,s2))
s3

0    1
1    2
0    3
dtype: int64

In [36]:
s1 = pd.Series([1,2])
s2 = pd.Series(3)
s3 = pd.concat((s1,s2)).reset_index(drop='true')
s3

0    1
1    2
2    3
dtype: int64

<h3>astype function</h3>

In [38]:
type(s1[0])

numpy.int64

In [39]:
type(s1.astype('float')[0])

numpy.float64

<h2>DataFrames</h2>

<h3>Create DataFrame</h3>

In [50]:
list = [1,2,3]
df = pd.DataFrame(list)
df

   0
0  1
1  2
2  3

In [48]:
list = [['a','b','c'],[1,2,3]]
df = pd.DataFrame(list)
df

   0  1  2
0  a  b  c
1  1  2  3

In [55]:
data = {
    'name' : ['Harsh','Tanvi','Preshtha'],
    'age' : [21,20,19]
}

df = pd.DataFrame(data)
df

       name  age
0     Harsh   21
1     Tanvi   20
2  Preshtha   19

In [56]:
df['name']

0       Harsh
1       Tanvi
2    Preshtha
Name: name, dtype: object

<h3>iloc and loc</h3>

In [57]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [59]:
df.loc[1:2,'two':'three']

   two  three
1   20    200
2   30    300

In [70]:
df.iloc[0:-1,1:]

   two  three  four
0   10    100  1000
1   20    200  2000
2   30    300  3000

In [65]:
df.loc[1]

one         2
two        20
three     200
four     2000
Name: 1, dtype: int64

<h3>Column Addition</h3>

In [71]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [72]:
list = [1,2,3,4]
df['five'] = list
df

   one  two  three  four  five
0    1   10    100  1000     1
1    2   20    200  2000     2
2    3   30    300  3000     3
3    4   40    400  4000     4

In [78]:
sr = pd.Series([10,20,30,40])
df['six'] = sr
df

   one  two  three  four  five  seven  six
0    1   10    100  1000     1    100   10
1    2   20    200  2000     2    200   20
2    3   30    300  3000     3    300   30
3    4   40    400  4000     4    400   40

In [74]:
df['seven'] = df['six'] * 10
df

   one  two  three  four  five  six  seven
0    1   10    100  1000     1   10    100
1    2   20    200  2000     2   20    200
2    3   30    300  3000     3   30    300
3    4   40    400  4000     4   40    400

<h3>Column Deletion</h3>

In [75]:
df

   one  two  three  four  five  six  seven
0    1   10    100  1000     1   10    100
1    2   20    200  2000     2   20    200
2    3   30    300  3000     3   30    300
3    4   40    400  4000     4   40    400

In [79]:
del df['six']
df

   one  two  three  four  five  seven
0    1   10    100  1000     1    100
1    2   20    200  2000     2    200
2    3   30    300  3000     3    300
3    4   40    400  4000     4    400

In [81]:
df.pop('five')
df

   one  two  three  four  seven
0    1   10    100  1000    100
1    2   20    200  2000    200
2    3   30    300  3000    300
3    4   40    400  4000    400

<h3>More DataFrame Functionalities</h3>

<h4>axes function</h4>

In [83]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four', 'seven'], dtype='object')]

<h4>ndim</h4>

In [84]:
df.ndim

2

<h4>dtypes</h4>

In [85]:
df.dtypes

one      int64
two      int64
three    int64
four     int64
seven    int64
dtype: object

<h4>shape</h4>

In [87]:
df.shape

(4, 5)

<h4>head()</h4>

In [89]:
d = { 'Name'  :pd.Series(['Harsh','Tanvi','Preshtha','Tilak','Keyur','Krupansh','Maun']),
      'Age'   :pd.Series([10,12,14,30,28,33,15]),
      'Height':pd.Series([3.25,1.11,4.12,5.47,6.15,6.67,2.61])}

df = pd.DataFrame(d)
df

       Name  Age  Height
0     Harsh   10    3.25
1     Tanvi   12    1.11
2  Preshtha   14    4.12
3     Tilak   30    5.47
4     Keyur   28    6.15
5  Krupansh   33    6.67
6      Maun   15    2.61

In [90]:
df.head(3)

       Name  Age  Height
0     Harsh   10    3.25
1     Tanvi   12    1.11
2  Preshtha   14    4.12

In [91]:
df.tail(3)

       Name  Age  Height
4     Keyur   28    6.15
5  Krupansh   33    6.67
6      Maun   15    2.61

<h3>Statistical or Mathematical Functions</h3>

In [92]:
data = {
    'one' : [1,2,3,4,5],
    'two' : [10,20,30,40,50],
    'three' : [100,200,300,400,500],
    'four' : [1000,2000,3000,4000,5000]
}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
4    5   50    500  5000

<h4>Sum | Mean | Median | Mode | Variance | Min | Max | Standard Deviation</h4>

In [98]:
df.sum()

one         15
two        150
three     1500
four     15000
dtype: int64

In [99]:
df.mean()

one         3.0
two        30.0
three     300.0
four     3000.0
dtype: float64

In [101]:
df.median()

one         3.0
two        30.0
three     300.0
four     3000.0
dtype: float64

In [103]:
df.var()

one            2.5
two          250.0
three      25000.0
four     2500000.0
dtype: float64

In [104]:
df.std()

one         1.581139
two        15.811388
three     158.113883
four     1581.138830
dtype: float64

In [105]:
df.min()

one         1
two        10
three     100
four     1000
dtype: int64

In [106]:
df.max()

one         5
two        50
three     500
four     5000
dtype: int64

<h3>Describe</h3>

In [107]:
df.describe()

            one        two       three        four
count  5.000000   5.000000    5.000000     5.00000
mean   3.000000  30.000000  300.000000  3000.00000
std    1.581139  15.811388  158.113883  1581.13883
min    1.000000  10.000000  100.000000  1000.00000
25%    2.000000  20.000000  200.000000  2000.00000
50%    3.000000  30.000000  300.000000  3000.00000
75%    4.000000  40.000000  400.000000  4000.00000
max    5.000000  50.000000  500.000000  5000.00000

<h3>Pipe Functions</h3>

<h4>Pipe function</h4>

In [108]:
data = {
    "One" : pd.Series([1,2,3,4]),
    "Two" : pd.Series([10,20,30,40]),
    "Three" : pd.Series([100,200,300,400]),
    "Four" : pd.Series([1000,2000,3000,4000])
}
df = pd.DataFrame(data)
df

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [110]:
def add(i, j):
    return i + j

df.pipe(add,10)

   One  Two  Three  Four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

<h4>2. Apply</h4>

In [114]:
df.apply(np.mean)

One         2.5
Two        25.0
Three     250.0
Four     2500.0
dtype: float64

In [115]:
df

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [116]:
df.apply(lambda x : x + 10)

   One  Two  Three  Four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

<h4>3. Apply map </h4>

In [117]:
df.applymap(lambda x : x + 10)

C:\Users\kalat\AppData\Local\Temp\ipykernel_3040\243131110.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x : x + 10)

   One  Two  Three  Four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

<h3>Renaming</h3>

In [124]:
df

   1   2    3     4
a  1  10  100  1000
b  2  20  200  2000
c  3  30  300  3000
d  4  40  400  4000

In [125]:
df.rename(index = { 0 : 'a', 1 : 'b', 2 : 'c', 3 : 'd'}, columns = { 'One' : 1, 'Two' : 2, 'Three' : 3, 'Four' : 4 }, inplace = True)
df

   1   2    3     4
a  1  10  100  1000
b  2  20  200  2000
c  3  30  300  3000
d  4  40  400  4000

<h3>Sorting</h3>

In [126]:
data = { 'one'   : pd.Series([11, 51, 31, 41]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 500, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0   11   10    100  1000
1   51   20    200  2000
2   31   30    500  3000
3   41   40    400  4000

In [127]:
df.sort_values(by = 'one', ascending = False)

   one  two  three  four
1   51   20    200  2000
3   41   40    400  4000
2   31   30    500  3000
0   11   10    100  1000

In [129]:
df.sort_values(by = ['one'], kind = 'quicksort')

   one  two  three  four
0   11   10    100  1000
2   31   30    500  3000
3   41   40    400  4000
1   51   20    200  2000

<h2>Working with CSV</h2>

<h3>Reading File</h3>

In [169]:
df = pd.read_csv("football.csv")

In [136]:
df.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016

In [137]:
df = pd.read_csv('https://raw.githubusercontent.com/AshishJangra27/Data-Analysis-with-Python-GFG/main/3.%20Data%20Preprocessing%20-%20Removing%20Null%20Value%20Rows/googleplaystore.csv')

In [131]:
df.head()

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite – FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up

<h3>Info</h3>

In [132]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10841 entries, 0 to 10840
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   App             10841 non-null  object
 1   Category        10841 non-null  object
 2   Rating          9367 non-null   float64
 3   Reviews         10841 non-null  object
 4   Size            10841 non-null  object
 5   Installs        10841 non-null  object
 6   Type            10840 non-null  object
 7   Price           10841 non-null  object
 8   Content Rating  10840 non-null  object
 9   Genres          10841 non-null  object
 10  Last Updated    10841 non-null  object
 11  Current Ver     10833 non-null  object
 12  Android Ver     10838 non-null  object
dtypes: float64(1), object(12)
memory usage: 1.1+ MB

In [133]:
df.isnull()

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
10836,False,False,False,False,False,False,False,False,False,False,False,False,False
10837,False,False,False,False,False,False,False,False,False,False,False,False,False
10838,False,False,True,False,False,False,False,False,False,False,False,False,False
10839,False,False,False,False,False,False,False,False,False,False,False,False,False
10840,False,False,False,False,False,False,False,False,False,False,False,False,False

In [134]:
df.isnull().sum()

App                  0
Category             0
Rating            1474
Reviews              0
Size                 0
Installs             0
Type                 1
Price                0
Content Rating       1
Genres               0
Last Updated         0
Current Ver          8
Android Ver          3
dtype: int64

In [174]:
df = pd.read_csv("football.csv")

In [139]:
df.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016

<h3>Value Count</h3>

In [141]:
df["Player Names"].value_counts()

Player Names
Andrea Belotti     5
Lionel Messi       5
Luis Suarez        5
Andrej Kramaric    5
Ciro Immobile      5
                  ..
Francois Kamano    1
Lebo Mothiba       1
Gaetan Laborde     1
Falcao             1
Cody Gakpo         1
Name: count, Length: 444, dtype: int64

In [144]:
df["League"].unique()

array(['La Liga', 'Serie A', 'Bundesliga', 'Premier League',
       'Campeonato Brasileiro SÃ©rie A', 'France Ligue 11',
       'France Ligue 20', 'France Ligue 2', 'France Ligue 12',
       'France Ligue 9', 'France Ligue 15', 'France Ligue 6',
       'France Ligue 3', 'France Ligue 16', 'France Ligue 14',
       'France Ligue 4', 'France Ligue 1', 'France Ligue 10',
       'France Ligue 7', 'France Ligue 13', 'France Ligue 8',
       'France Ligue 5', 'France Ligue 19', 'France Ligue 18',
       'France Ligue 17', 'MLS', 'Primeira Liga', 'Eredivisie'],
      dtype=object)

In [145]:
df["League"].nunique()

28

In [146]:
df.isnull().sum()

Country                     0
League                      0
Club                       34
Player Names                0
Matches_Played              0
Substitution                0
Mins                        0
Goals                       0
xG                          0
xG Per Avg Match            0
Shots                       0
OnTarget                    0
Shots Per Avg Match         0
On Target Per Avg Match     0
Year                        0
dtype: int64

<h3>dropna function</h3>

In [177]:
df = pd.read_csv('https://raw.githubusercontent.com/AshishJangra27/Data-Analysis-with-Python-GFG/main/3.%20Data%20Preprocessing%20-%20Removing%20Null%20Value%20Rows/googleplaystore.csv')

In [155]:
df.isnull().sum()

App                  0
Category             0
Rating            1474
Reviews              0
Size                 0
Installs             0
Type                 1
Price                0
Content Rating       1
Genres               0
Last Updated         0
Current Ver          8
Android Ver          3
dtype: int64

In [156]:
df.dropna(inplace = True, axis = 0)

In [157]:
df.dropna(inplace = True, axis = 1)

In [158]:
df.isnull().sum()

App               0
Category          0
Rating            0
Reviews           0
Size              0
Installs          0
Type              0
Price             0
Content Rating    0
Genres            0
Last Updated      0
Current Ver       0
Android Ver       0
dtype: int64

<h3>fillna function</h3>

In [160]:
link = 'https://raw.githubusercontent.com/AshishJangra27/Data-Analysis-with-Python-GFG/main/3.%20Data%20Preprocessing%20-%20Removing%20Null%20Value%20Rows/googleplaystore.csv'

df = pd.read_csv(link)

print(len(df))

10841

In [161]:
mis = round(df['Rating'].mean(),2)

df['Rating'] = df['Rating'].fillna(mis)

print(len(df))

10841

In [162]:
df['Current Ver'] = df['Current Ver'].fillna('Varies on Device')

<h3>to_csv()</h3>

In [163]:
data = {
    "One" : pd.Series([1,2,3,4]),
    "Two" : pd.Series([10,20,30,40]),
    "Three" : pd.Series([100,200,300,400])
}
df = pd.DataFrame(data)

In [164]:
df

   One  Two  Three
0    1   10    100
1    2   20    200
2    3   30    300
3    4   40    400

In [165]:
df.to_csv("numbers.csv")

In [173]:
df.duplicated().sum()

0